Revit 2027 API
PropertyTableEntry Constructor
 Constructs a new copy of the input PropertyTable object.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public PropertyTableEntry(
	PropertyTableEntry other
)
Public Sub New (
	other As PropertyTableEntry
)
public:
PropertyTableEntry(
	PropertyTableEntry^ other
)
new :
        other : PropertyTableEntry -> PropertyTableEntry
Parameters
other PropertyTableEntry
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
PropertyTableEntry Class
Autodesk.Revit.DB Namespace